{
    "uuid": [
        {
            "value": "d95e4710-be0b-49c9-8300-e02f339bf023"
        }
    ],
    "langcode": [
        {
            "value": "en"
        }
    ],
    "type": [
        {
            "target_id": "book",
            "target_type": "node_type",
            "target_uuid": "870f5e4b-075f-48ba-972b-7b47064b4efd"
        }
    ],
    "revision_timestamp": [
        {
            "value": "2018-11-30T23:14:11+00:00",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "revision_uid": [
        {
            "target_type": "user",
            "target_uuid": "ed803c7d-e897-4ebb-99a7-1de7754316c4"
        }
    ],
    "revision_log": [],
    "status": [
        {
            "value": true
        }
    ],
    "title": [
        {
            "value": "Using Tome Static and Tome Sync"
        }
    ],
    "uid": [
        {
            "target_type": "user",
            "target_uuid": "ed803c7d-e897-4ebb-99a7-1de7754316c4"
        }
    ],
    "created": [
        {
            "value": "2018-11-30T23:12:53+00:00",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "changed": [
        {
            "value": "2018-11-30T23:23:16+00:00",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "promote": [
        {
            "value": false
        }
    ],
    "sticky": [
        {
            "value": false
        }
    ],
    "default_langcode": [
        {
            "value": true
        }
    ],
    "revision_translation_affected": [
        {
            "value": true
        }
    ],
    "path": [
        {
            "alias": "\/docs\/sub-modules",
            "langcode": "en"
        }
    ],
    "body": [
        {
            "value": "<p>Tome includes two sub-modules, Tome Static and Tome Sync, which can be used separately for specific use cases. This document will try to cover why you may want to only use one half of Tome.<\/p>\r\n\r\n<h2>Tome Static<\/h2>\r\n\r\n<p>The Tome Static sub-module handles static site (HTML) generation, and is useful if you are comfortable with you existing Drupal stack, but still want to run a static site on production.<\/p>\r\n\r\n<p>When just running Tome Static, you'll need to decide how and when to kick off the static site generation process. In the future a \"tome:static:watch\" command may be added which you can run as a persistent background process, but for now you'll probably want to run \"tome:static\" in a cron job, which can also push the export directory to your hosting provider.<\/p>\r\n\r\n<p>To get the same security benefit of running traditional Tome, you should lock down your editing environment so that only authorized users can access it. This can be accomplished by adding simple basic authentication to your site, or by requiring a VPN to access your editing environment.<\/p>\r\n\r\n<h2>Tome Sync<\/h2>\r\n\r\n<p>The Tome Sync sub-module handles static content export and import, and is useful if you want to build your site from scratch, or prefer to work with your content as JSON.<\/p>\r\n\r\n<p>The use-cases for Tome Sync as a standalone module aren't completely clear right now, but there are a lot of possibilities for this sub-module without generating a static site. Maybe you want to migrate away from Drupal and JSON would make that easier, or you're using GatsbyJS which is lightning fast when using JSON files, or you want to archive a site's content and de-commission it from production. Tome Sync is powerful, so I encourage users to try it out and let me know if you find where it fits into your workflow.<\/p>\r\n",
            "format": "rich_text",
            "summary": ""
        }
    ]
}