{
    "uuid": [
        {
            "value": "35c0a22b-5453-44a0-92c6-73f8f206d094"
        }
    ],
    "langcode": [
        {
            "value": "en"
        }
    ],
    "type": [
        {
            "target_id": "book",
            "target_type": "node_type",
            "target_uuid": "870f5e4b-075f-48ba-972b-7b47064b4efd"
        }
    ],
    "revision_timestamp": [
        {
            "value": "2018-06-16T22:02:18+00:00",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "revision_uid": [
        {
            "target_type": "user",
            "target_uuid": "ed803c7d-e897-4ebb-99a7-1de7754316c4"
        }
    ],
    "revision_log": [],
    "status": [
        {
            "value": true
        }
    ],
    "uid": [
        {
            "target_type": "user",
            "target_uuid": "ed803c7d-e897-4ebb-99a7-1de7754316c4"
        }
    ],
    "title": [
        {
            "value": "Getting started"
        }
    ],
    "created": [
        {
            "value": "2018-06-16T21:58:14+00:00",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "changed": [
        {
            "value": "2022-04-26T15:38:43+00:00",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "promote": [
        {
            "value": false
        }
    ],
    "sticky": [
        {
            "value": false
        }
    ],
    "default_langcode": [
        {
            "value": true
        }
    ],
    "revision_translation_affected": [
        {
            "value": true
        }
    ],
    "path": [
        {
            "alias": "\/docs\/getting-started",
            "langcode": "en"
        }
    ],
    "body": [
        {
            "value": "<p>While anyone can download and install Tome on a new or existing Drupal site, it works best when used with specific Drupal configurations. This guide will take you from creating a new site to making your first commit.<\/p>\r\n\r\n<p>Before continuing, it’s expected that your local machine has:<\/p>\r\n\r\n<ol>\r\n\t<li>PHP 7 or greater installed.<\/li>\r\n\t<li>SQLite&nbsp;3.26+&nbsp;<\/li>\r\n\t<li>Composer installed globally.<\/li>\r\n<\/ol>\r\n\r\n<p>A global Drush installation is not required to use Tome, but is easier to use than typing “.\/vendor\/bin\/drush” every time you want to run a command. This guide will assume that the “drush” command is available.<\/p>\r\n\r\n<p>To start, create a new instance of the starter project by running:<\/p>\r\n\r\n<pre>\r\n<code class=\"language-bash\">composer create-project drupal-tome\/tome-project my_site --stability dev --no-interaction --no-install\r\ncd my_site\r\ncomposer install\r\ngit init\r\ngit add .\r\ngit commit -m 'Initial commit of starter codebase.'<\/code><\/pre>\r\n\r\n<p>The starter kit only comes with Drupal core, so you’ll probably need to install contributed themes and modules as well. Eventually the starter kit will come with a Tome-specific distribution, which will be the recommended way to make simple sites. Since Tome is still in development, things are bare-bones for now.<\/p>\r\n\r\n<p><strong>Optional:<\/strong><em>&nbsp;<\/em>This is a good time to install a contributed install profile, for example <a href=\"https:\/\/github.com\/drupal-tome\/bookish\">Bookish<\/a>&nbsp;which is specially crafted for Tome blogs. You can see a demo of Bookish at&nbsp;<a href=\"https:\/\/bookish-drupal.netlify.app\">https:\/\/bookish-drupal.netlify.app<\/a>&nbsp;to see if it's something you'd like to use. To install Bookish, run \"composer require drupal-tome\/bookish\".<\/p>\r\n\r\n<p>Next you’ll need to initialize your site by choosing an install profile. Run:<\/p>\r\n\r\n<pre>\r\n<code class=\"language-bash\">drush tome:init<\/code><\/pre>\r\n\r\n<p>If you don't want to use Bookish, I would recommend&nbsp;using the \"Standard\" profile when prompted, since it comes with a default theme and content types. If you installed Standard, you will probably want to uninstall the modules that don't make sense for a static site. To do this, run:<\/p>\r\n\r\n<pre>\r\n<code class=\"language-bash\">drush pmu search history contact -y<\/code><\/pre>\r\n\r\n<p>If you run “git status” at this point, you should see that the “config” folder is full of exported configuration. You’ll want to commit those changes now so you have a base to work off of in your history. Run:<\/p>\r\n\r\n<pre>\r\n<code class=\"language-bash\">git add .\r\ngit commit -am 'Installed the Standard profile.'<\/code><\/pre>\r\n\r\n<p>Next you’ll need to start up a local webserver. In a new tab, run:<\/p>\r\n\r\n<pre>\r\n<code class=\"language-bash\">cd [path to your my_site codebase]\r\ndrush runserver 127.0.0.1:8888<\/code><\/pre>\r\n\r\n<p>Then switch back to your original tab, and run \"drush uli -l 127.0.0.1:8888\"<\/p>\r\n\r\n<p>A browser window should pop up and log you in as admin.<\/p>\r\n\r\n<p>Now you’re ready to start using Drupal to build you site. Let’s start by adding a new article. Expand “Shortcuts” in the admin toolbar, click “Add content”, then “Article”. Fill out the fields to your liking, and make sure to upload an image.<\/p>\r\n\r\n<p>Once your article has been created, go back to your command line window and run “git status”. You should see that&nbsp;two new files exist in the “content” directory, one for the article node you made, and one for the file you uploaded. There should also be a copy of your uploaded file in the “files” directory. Feel free to commit these files now if you’d like.<\/p>\r\n\r\n<p>Tome is always watching your site for changes, and automatically syncs modified config, content, and files as needed. Running “drush tome:export”, which exports everything currently on your site, should be pretty rare after your initial install.<\/p>\r\n\r\n<p>We’re going to test that your site can be fully rebuilt from scratch, to ensure that everything is working properly. Run:<\/p>\r\n\r\n<pre>\r\n<code class=\"language-bash\">drush tome:install<\/code><\/pre>\r\n\r\n<p>If you visit your site again, you should see that your article and image as they originally appeared.<\/p>\r\n\r\n<p>Even though your site doesn't have much going on yet, let’s test the static site generation as well. Whenever you’re ready to generate static HTML for your site, run:<\/p>\r\n\r\n<pre>\r\n<code class=\"language-bash\">drush tome:static<\/code><\/pre>\r\n\r\n<p>This should put a copy of your site in the “html” directory, which you can then upload to a host of your choosing.<\/p>\r\n\r\n<p><strong>Optional<i>:<\/i><\/strong>&nbsp;If you're using Bookish, you'll need to index your search results before running \"drush tome:static\". For more information, visit \/admin\/help\/topic\/bookish_help.tome on your local site to view the related Bookish Help Topic.<\/p>\r\n\r\n<p>That's it for now. You're free to start making your Tome site. Make sure to check out the other documentation, and keep in mind that the project is still in development. Thanks!<\/p>\r\n\r\n<p>&nbsp;<\/p>\r\n",
            "format": "rich_text",
            "summary": "Get started with Tome by following this guide."
        }
    ]
}